{
    "personal": {
        "name": "Umer Zahoor",
        "details": [
            {
                "label": "Web Developer",
                "icon": "fa-briefcase"
            },
            {
                "label": "Vaughan, Ontario, Canada",
                "icon": "fa-map-marker"
            },
            {
                "label": "uzahoor127@gmail.com",
                "icon": "fa-envelope"
            }
        ]
    },
    "sections": [
        {
            "title": {
                "name": "Technical Skills",
                "icon": "fa-terminal",
                "shortName": "ts"
            },
            "skills": [
                {
                    "title": "AngularJS",
                    "exp": "2 Years Experience",
                    "img": "img/angular.svg",
                    "rating": 4.5,
                    "points": [
                        "Built and maintained an access control administrative web page to be used by building managers, built using AngularJS.",
                        "Built hardware testing and monitoring web page for access control device to be used for device testing and diagnostics, using AngularJS.",
                        "Taken three courses for Angular one hosted by Angular Academy and two hosted by Rangle.io."
                    ]
                },

                {
                    "title": "Java",
                    "exp": "5 Years Experience",
                    "img": "img/java.png",
                    "rating": 4.5,
                    "points": [
                        "Maintained an emergency response administrative page using Java, Apache Tomcat, and Java Spring.",
                        "Built a parking kiosk touch screen application to be used by commuters to pay for parking. Built using Java and Java Swing.",
                        "Built a program to convert a raw music sheet to a human readable PDF music sheet. Built using Java and Java Swing."
                    ]
                },
                {
                    "title": "jQuery",
                    "exp": "4 Years Experience",
                    "img": "img/jQuery.gif",
                    "rating": 4,
                    "points": [
                        "Maintained an access control administrative web page for building managers, built using JQuery. Which was later converted to an AngularJS application.",
                        "Taken various courses that cover JQuery at York University."
                    ]
                },
                {
                    "title": "HTML5 ",
                    "exp": "5 Years Experience",
                    "img": "img/html5.svg",
                    "rating": 4.5,
                    "points": [
                        "Built and maintained an access control administrative web page for building managers, built using HTML5 and AngularJS templating.",
                        "Built this webpage using PugJS a HTML templating engine, please feel free to check out the code on <a href='https://github.com/uzahoor/umer.io'>GitHub</a>.",
                        "Taken various courses that cover HTML5 at York University."
                    ]
                },
                {
                    "title": "SASS",
                    "exp": "1 Year Experience",
                    "img": "img/sass.png",
                    "rating": 3.5,
                    "points": [
                        "Built this webpage using SASS, please feel free to check out the code on <a href='https://github.com/uzahoor/umer.io'>GitHub</a>.",
                        "Styled an access control administrative web page for building managers using Bootstrap and SASS.",
                        "Styled hardware testing and monitoring web page for access control device, using SASS."
                    ]
                },
                {
                    "title": "Bootstrap ",
                    "exp": "2 Years Experience",
                    "img": "img/bootstrap.svg",
                    "rating": 3.5,
                    "points": [
                        "Built this webpage using a bootstrap, please feel free to check out the code on <a href='https://github.com/uzahoor/umer.io'>GitHub</a>.",
                        "Styled an access control administrative web page for building managers using Bootstrap and SASS."
                    ]
                },
                {
                    "title": "PHP",
                    "img": "img/php.svg",
                    "exp": "2 Years Experience",
                    "rating": 3.5,
                    "points": [
                        "Built and maintained a REST API for an access control administrative web page to be used by building managers, built using PHP, Slim Framework."
                    ]
                }
                
            ]
        },
        {
            "title": {
                "name": "Experience",
                "icon": "fa-industry",
                "shortName": "exp"
            },
            "exp": [
                {
                    "company": "Mircom Group of Companies",
                    "time": "Sept 2015 - Current",
                    "position": "Web Developer",
                    "projects": [
                        {
                            "name": "Single page application for access control system",
                            "summary": "Build and maintain a front end used to configure settings such as resident directory, schedules, credentials, access points, etc. Allow monitoring of access control devices to give live data on the status of access points.",
                            "points": [
                                "Build and maintain a responsive user interface using AngularJS, Bootstrap, SASS, Webpack, JQuery, JavaScript, CSS, and HTML.",
                                "Using web sockets to get status of access points, allowing user to see who is entering and if there is any trouble at an access point."
                            ]
                        },
                        {
                            "name": "Cloud based solution for access control system",
                            "summary": "Creating a cloud based solution to manage and monitor access control systems.",
                            "points": [
                                "Database built using MySQL and exposed using a REST API, hosted on Amazon RDS. REST API built using PHP, Slim Framework (PHP framework) and hosted using Amazon EC2.",
                                "Device events handled through web sockets to allow live monitoring and instantaneous responses on correlated devices."
                            ]
                        },

                        {
                            "name": "Web based hardware testing tool",
                            "summary": "Building a web page used to monitor and record hardware test results for the numerous sensors, components and inputs.",
                            "points": [
                                "Receiving live data through web sockets and then displaying the data using Angular and Chart.js to visualize and record hardware test results."
                            ]
                        },

                        {
                            "name": "MiEntry (Access control app)",
                            "summary": "Provide residents with a mobile app that allows video calls from access panels and to use a mobile device in place of an access card.",
                            "points": [
                                "Created specifications for team in India to develop for both Android and iOS",
                                "Created test plan to ensure that the specification was met."
                            ]
                        },

                        {
                            "name": "Metis Secure (Emergency notification)",
                            "summary": "Maintaining command center web page, which controls various alarm devices. Being able to send alerts, respond to request for helps with live audio calls, and notify through e-mail and SMS.",
                            "points": [
                                "Using Java, Maven, JavaScript, NetBeans, and Spring Framework."
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": {
                "name": "Education",
                "icon": "fa-graduation-cap",
                "shortName": "edu"
            },
            "edu": [
                {
                    "name": "York University",
                    "time": "Oct 2015",
                    "location": "Toronto, ON",
                    "img": "img/lassonde.jpg",
                    "degree": "Bachelor of Science in Computer Science"
                },
                {
                    "name": "Angular Academy",
                    "time": "Feb 2016",
                    "location": "Toronto, ON",
                    "img": "img/aa.png",
                    "degree": "Training for AngularJS 1"
                },
                {
                    "name": "Rangle.io",
                    "time": "Sept 2016, Nov 2016",
                    "location": "Vaughan, ON",
                    "img": "img/rangleio.png",
                    "degree": "Two training sessions for Angular 2"
                },
                {
                    "name": "Udemy",
                    "time": "Nov 2017",
                    "location": "Online",
                    "img": "img/udemy.png",
                    "degree": "Complete React JS web developer with ES6"
                }
            ]
        }
    ]
}